[
  {
    "title": "Introduction",
    "content": "The combination of heroes played in a DOTA2 match significantly influences the team's success.\n\nVarious companies have attempted to predict the winning rate based on hero selections, but the robustness of their predictions is unknown and relationships between heroes that would influence the winning result are still undiscovered.\n\nTherefore, in this project, we aim to predict pro match results based on the selected heroes after the pick and ban phase using machine learning techniques and find relationships between certain heroes that would affect the result. We will also test the robustness of our result.\n\nWe analyze historical DOTA2 data by using API and train our model based on the heroes' features and stats.\n\nThe model can help players make informed decisions during the pick and ban phase and improve their chances of winning.\n\nFor the model, we employed neural networks, decision trees, random forest, and XGBoost to predict the winning team.\n\nWe found that the best-performing model was the random forest with an accuracy of 51.4%."
  },
  {
    "title": "Methods",
    "content": "We employed various types of machine learning models to predict the winning rate of each team based on their hero selections in DOTA2.\n\nWe aimed to identify the hero features that have the most influence on the outcome of a match and experimented with neural networks, decision trees, random forest, and XGBboost to build a predictive model.\n\nWe evaluated and determined which model best suits our dataset for prediction by looking at cross-validation and accuracy of each model.\n\nWe investigated how the model captures the Anti-Mage VS Medusa counter relationship, a well-known counter in the DOTA2 community, using the available data to see if the relationship between heroes can influence the accuracy of the model.\n\nWe evaluated the confidence and accuracy of the decision trees used in the model to assess its reliability and robustness.\n\nThis approach ensures that our model can be used to make accurate predictions about the outcome of matches in DOTA2."
  },
  {
    "title": "Results",
    "content":"The random forest model gave the best prediction result of 51.4% accuracy after testing with different types of models.\n\nThe random forest model can predict the winning team correctly 51.4% of the time after both teams select their heroes.\n\nWe analyzed potential winning strategies, such as selecting a hero based on their counter relationship with other heroes in the game.\n\nIf the model learns that Anti-Mage counters Medusa, the accuracy of our best model (using Random Forest) can improve to 58.3%.\n\nWe examined the prediction of each tree in the Random Forest model and found that the more confident the model is in the winning probability, the more accurate the prediction is.\n\nOur model prediction is robust and can be useful for the DOTA2 community and players."
  },
  {
    "title": "Discussion",
    "content": "Our model's accuracy is not perfect but it is a good start in predicting DOTA2 match results based on hero selections.\n\nTo improve our model's prediction accuracy, we need to train it on more data and let it learn more hero counter relationships.\n\nPro players and team corporations' characteristics are also essential in determining the outcome of a match, and we could try to predict non-pro DOTA2 matches where match results may be more dependent on hero selections.\n\nOur model will help the DOTA2 community and players make more informed decisions during the pick and ban phase, improving their chances of winning.\n\nThe strength of our model is that it gives us a prediction that is robust and we have discovered some hero selection relationships that could influence the winning rate, such as the example between Anti-Mage and Medusa, which are useful for players to consider."
  }
]
